labri-progress/d2dpls/STM32PlatformCode/Firmware/SubGHz_Phy/App/subghz_phy_app.c
/*!
 * \file      subghz_phy_app.c
 *
 * \brief     PHYKeyGen implementation
 *
 * \copyright Revised BSD License, see section \ref LICENSE.
 *
 * \code
 *                ______                              _
 *               / _____)             _              | |
 *              ( (____  _____ ____ _| |_ _____  ____| |__
 *               \____ \| ___ |    (_   _) ___ |/ ___)  _ \
 *               _____) ) ____| | | || |_| ____( (___| | | |
 *              (______/|_____)_|_|_| \__)_____)\____)_| |_|
 *              (C)2013-2017 Semtech
 *
 * \endcode
 *
 * \author    Miguel Luis ( Semtech )
 *
 * \author    Gregory Cristian ( Semtech )
 */
/**
 ******************************************************************************
 *
 *          Portions COPYRIGHT 2020 STMicroelectronics
 *
 * @file    subghz_phy_app.c
 * @author  MCD Application Team
 * @brief   Application of the SubGHz_Phy Middleware
 ******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/
#include "subghz_phy_app.h"

#include "app_version.h"
#include "cmox_crypto.h"
#include "hash/cmox_sha256.h"
#include "physec_config.h"
#include "physec_radio.h"
#include "physec_telemetry.h"
#include "physec_utils.h"
#include "platform.h"
#include "stm32_mem.h"
#include "stm32l0xx_hal.h"
#include "stm32l0xx_hal_rng.h"
#include "stm32l0xx_hal_uart.h"
#include "sx1276.h"
#include "sys_app.h"
/* USER CODE BEGIN Includes */
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <sys/types.h>

#include "dma.h"
#include "radio.h"
#include "stm32_seq.h"
#include "stm32_timer.h"
#include "usart.h"
#include "usart_if.h"
#include "utilities_conf.h"
#include "utilities_def.h"

// #include "lorawan_aes.h"
// #include "cmac.h"

#define __PHYSEC_SX1276__
#include "libphysec/acquisition.h"
#include "libphysec/packet.h"
#include "libphysec/pre_processing.h"
#include "libphysec/quantization.h"
#include "libphysec/reconciliation/reconciliation.h"
#include "libphysec/types.h"
#include "libphysec/utils.h"
#include "physec_serial.h"

/**
 * PHYsec
 *
 * Key Generation:
 *	- Alice is the master, and Bob the slave
 *	- Alice calculates the metrics on datasets and results (keys)
 *;
 *
 */

/* USER CODE END Includes */

/* External variables
 * ---------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* USER CODE BEGIN PV */

/* Led Timers objects*/
UTIL_TIMER_Object_t timerLed;
uint8_t uart_rx_buf[MAX_UART_BUF_SIZE] = {0};

/* Related to key generation phases */

size_t num_quantized_csi = 0;
size_t num_csi = 0;
size_t num_indexes = 0;
size_t probe_cnt = 0;
size_t num_remote_indexes = 0;

/* related to trigger signals */
struct {
  bool start_signal_sent;
  bool quant_signal_sent;
  bool recon_signal_sent;
  bool kg_end_signal_sent;
} trigger_signals = {0};

uint8_t physec_key[KEY_CAPACITY_IN_BYTES] = {0};
int16_t physec_key_num_bits = -1;
csi_t csi_measures[NUM_MAX_CSI] = {0};
quant_index_t indexes[NUM_MAX_QUANT_INDEX] = {0};
// used for excursion based quant where you need
// to receive all indexes before computing final
// indexes set (intersection of excursions from Alice and Bob)
quant_index_t remote_indexes[NUM_MAX_EXCURSIONS(QUANT_SB_EXCURSION_MAX_M)] = {
    0};
quant_lossy_params_t quant_params = {0};
uint16_t num_csi_more = 0;
// the number of slave unsucessfull tries to quantize,
// it helps determining how many probes we will
// exchange before trying quantization again
uint8_t num_quant_try = 0;
bool post_process_expired = false;
// MAX_LOSSY_CHUNKS = 16, fits in an uint16_t
uint8_t post_process_num_chunks_to_rx = 0;
lossy_chunk_bitmap_t post_process_rx_chunks = 0;

// TODO: better state managements than lost alone booleans
bool on_config = false;
bool config_done = false;

uint8_t quant_status = QUANT_STATUS_WAITING;
physec_state_t physec_state = PHYSEC_STATE_PROBING;
extern physec_config physec_conf;

/* Reconciliation (Work In Progress)*/
uint32_t recon_num_try = 0;
uint8_t recon_key[AES_KEY_SIZE_IN_BYTES];
physec_prng_t r_prng;
physec_prng_t l_prng;
physec_prng_t m_prng;

void logger(const char *fmt, va_list args) {
  char buf[1024];
  vsnprintf(buf, sizeof(buf), fmt, args);
  tm_plog(TS_ON, VLEVEL_M, "%s\r\n", buf);
}

/* UART related */
uint8_t uart_buf[256] = {0};
size_t uart_bufsize = 0;
uint8_t cfg_type = 0xff;
size_t expected = 0;
size_t num_expected_csi = 0;
uint32_t csi_packet_bytes_remaining = 0;

/* USER CODE END PV */

/* USER CODE BEGIN PFP */
/**
 * @brief  Function executed on when led timer elapses
 * @param  context ptr of LED context
 */
static void OnledEvent(void *context);

/**
 * @brief PHYsec_Platform state machine implementation
 */

/* USER CODE END PFP */
/* Exported functions
 * ---------------------------------------------------------*/
static void update_physec_state(physec_state_t next_state) {
  // TODO:
  // - right now, we don't handle really well going back and forth from and to
  // states (eg. probing -> quant (failed) -> probing). we might find a way to
  // differenciate signals so we can have independent phase counters updated
  // regarding last phase signal

  // moments when trigger signal shall be sent
  switch (next_state) {
  /* starting a new keygen. the check on probe_cnt is to prevent re-probing due
   * to unsuccessful quantization */
  case PHYSEC_STATE_PROBING:
    if (!trigger_signals.start_signal_sent) {
      trigger_signals.start_signal_sent = true;
      HAL_GPIO_SIGNAL_TRIGGER(TRIGGER_DURATION_CYCLES);
    }
    break;
  case PHYSEC_STATE_KEYGEN:
  case PHYSEC_STATE_POST_KEYGEN_SEND:
  case PHYSEC_STATE_POST_KEYGEN_WAIT:
    if (!trigger_signals.quant_signal_sent) {
      trigger_signals.quant_signal_sent = true;
      HAL_GPIO_SIGNAL_TRIGGER(TRIGGER_DURATION_CYCLES);
    }
    break;
  case PHYSEC_STATE_PRE_RECONCILIATION:
  case PHYSEC_STATE_RECONCILIATION:
    if (!trigger_signals.recon_signal_sent) {
      trigger_signals.recon_signal_sent = true;
      HAL_GPIO_SIGNAL_TRIGGER(TRIGGER_DURATION_CYCLES);
    }
    break;
  case PHYSEC_STATE_KEY_READY:
    if (!trigger_signals.kg_end_signal_sent) {
      trigger_signals.kg_end_signal_sent = true;
      HAL_GPIO_SIGNAL_TRIGGER(TRIGGER_DURATION_CYCLES);
    }
    break;
  }
  physec_state = next_state;
}

void SubghzApp_Init(void) {
  /* USER CODE BEGIN SubghzApp_Init_1 */
  /* Print APP version*/
  tm_plog(TS_OFF, VLEVEL_M, "APP_VERSION= V%X.%X.%X\r\n",
          (uint8_t)(__APP_VERSION >> __APP_VERSION_MAIN_SHIFT),
          (uint8_t)(__APP_VERSION >> __APP_VERSION_SUB1_SHIFT),
          (uint8_t)(__APP_VERSION >> __APP_VERSION_SUB2_SHIFT));

