labri-progress/d2dpls/STM32PlatformCode/Firmware/SubGHz_Phy/App/subghz_phy_app.c
  if ((1 << indexes_pkt->dropped_chunk_id) & post_process_rx_chunks) {
    // already received
    return 0;
  }
  size_t to_copy = indexes_pkt->num_dropped > MAX_LOSSY_PER_RADIO_FRAME
                       ? MAX_LOSSY_PER_RADIO_FRAME
                       : indexes_pkt->num_dropped;

  tm_plog(TS_ON, VLEVEL_L, "num_indexes = %u\n\r", num_indexes);
  for (size_t i = 0; i < to_copy; i++) {
    tm_plog(TS_ON, VLEVEL_L, "index[%d] = %u\n\r",
            indexes_pkt->dropped_chunk_id * MAX_LOSSY_PER_RADIO_FRAME + i,
            indexes_pkt->dropped[i]);
  }
  switch (physec_conf.keygen.quant_type) {
  case QUANT_SB_EXCURSION_LOSSY:
  case QUANT_MB_EXCURSION_LOSSY: {
    // cannot perform intersection
    // without receiving whole
    // indexes from remote host
    quant_index_t *cur_chunk_remote_idxs_start =
        remote_indexes +
        indexes_pkt->dropped_chunk_id * MAX_LOSSY_PER_RADIO_FRAME;
    memcpy(cur_chunk_remote_idxs_start, indexes_pkt->dropped,
           to_copy * sizeof(quant_index_t));
    num_remote_indexes += to_copy;
    break;
  }
  default:
    if (!quant_merge_csi_indexes(indexes, &num_indexes, NUM_MAX_QUANT_INDEX,
                                 indexes_pkt->dropped, to_copy)) {
      // TODO: abort
      return -1;
    }

    break;
  }

  post_process_rx_chunks |=
      (1 << indexes_pkt->dropped_chunk_id); // add chunk id to received bitmap
  tm_plog(TS_ON, VLEVEL_L,
          "> PLS - Received lossy indexes chunk %u (num=%u)\n\r",
          indexes_pkt->dropped_chunk_id, indexes_pkt->num_dropped);

  if (bitmap_hamming_weight(post_process_rx_chunks) ==
      post_process_num_chunks_to_rx) {
    return post_process_num_chunks_to_rx;
  } else if (post_process_expired) {
    // TODO: move out to rx timeout
  }
  return 0;
}

static int handle_keygen(physec_keygen_packet_t *kg_pkt, bool master) {
  if (!master && quant_status != QUANT_STATUS_DONE) {
    // first keygen packet indicate slave to quantize
    int quant_ret = pre_process_and_quantize();
    tm_plog(TS_ON, VLEVEL_L, "> Slave Q() (%d measures) => %d bits\n\r",
            num_csi, quant_ret);
    if (quant_ret < REQUIRED_NUM_BITS_PER_KEY) {
      quant_status = QUANT_STATUS_FAILURE;
      return KG_QUANT_ERROR;
    }
    tm_plog(TS_ON, VLEVEL_L, "CSI handle keygen:\r\n");
    tm_send_csis(csi_measures, num_csi);
    tm_plog(TS_ON, VLEVEL_M, "> Keygen Done ! (%d bits)\n\r",
            physec_key_num_bits);
    tm_send_key_info(KEY_TYPE_QUANT, physec_key, physec_key_num_bits);
    // physec_key_num_bits = quant_ret;
    quant_status = QUANT_STATUS_DONE;
  }

  switch (kg_pkt->kg_type) {
  case PHYSEC_KEYGEN_TYPE_DONE: {
    return KG_SLAVE_DONE;
    break;
  }
  case PHYSEC_KEYGEN_TYPE_DATA: {
    physec_keygen_data_t *kg_data = (physec_keygen_data_t *)&(kg_pkt->data);
    if (!QUANT_IS_LOSSY(physec_conf.keygen.quant_type)) {
      if (!master && kg_data->num_dropped == 0 &&
          kg_data->dropped_chunk_id == 0) {
        // Master successfully quantize
        return KG_DONE;
      }
      // invalid packet for lossless quantization
      break;
    }

    if (post_process_handle_rx_indexes(kg_data, physec_conf.keygen.is_master) <=
        0) {
      return KG_PP_WAIT_MORE;
    }

    if (master) {
      return KG_DONE;
    } else {
      size_t num_information_bits = 0;
      if (QUANT_IS_EXCURSION(physec_conf.keygen.quant_type)) {
        num_information_bits = num_remote_indexes;
      } else {
        num_information_bits = physec_key_num_bits - num_indexes;
      }
      if (num_information_bits >= REQUIRED_NUM_BITS_PER_KEY) {
        // enough bits after post processing
        return KG_PP_SEND_ALL;
      } else {
        // too much points dropped, not enough bits
        // anymore
        quant_status = QUANT_STATUS_FAILURE;
        return KG_QUANT_ERROR;
      }
    }
  }
  case PHYSEC_KEYGEN_TYPE_RETRANSMISSION_REQ: {
    physec_keygen_retransmission_req_t *retransmission_req =
        (physec_keygen_retransmission_req_t *)&(kg_pkt->data);

    if (!master &&
        (physec_state >= PHYSEC_STATE_RECONCILIATION ||
         bitmap_hamming_weight(retransmission_req->lost_chunks_bitmap) == 0)) {
      return KG_DONE;
    }

    return KG_PP_SEND_LOST;
  }
  case PHYSEC_KEYGEN_TYPE_ERROR:
    return KG_QUANT_ERROR;
  default:
    break;
  }

  return KG_QUANT_ERROR;
}

// Performs quantization (Master only function)
static bool do_keygen(void) {

  int quant_ret = pre_process_and_quantize();
  tm_plog(TS_ON, VLEVEL_L,
          "nb of bits in the physec_key returned by pre_process_and_quantize = "
          "%d bits:\r\n",
          quant_ret);
  if (quant_ret < REQUIRED_NUM_BITS_PER_KEY) {
    return false;
  }
  tm_plog(TS_ON, VLEVEL_L, "CSI do keygen:\r\n");

  tm_send_csis(csi_measures, num_csi);
  tm_send_key_info(KEY_TYPE_QUANT, physec_key, physec_key_num_bits);
  // physec_key_num_bits = quant_ret;

  if (QUANT_IS_LOSSY(physec_conf.keygen.quant_type)) {
    num_indexes =
        (num_indexes > NUM_MAX_QUANT_INDEX) ? NUM_MAX_QUANT_INDEX : num_indexes;
    post_process_send_indexes(ALL_ONES_MASK);
    time_last_pp_send_all = HAL_GetTick();
    update_physec_state(PHYSEC_STATE_POST_KEYGEN_SEND);
  } else {
    physec_packet_t *packet = build_keygen_success_packet_lossless(
        physec_conf.keygen.keygen_id, BufferTx, MAX_APP_BUFFER_SIZE);
    Radio.Send((uint8_t *)packet, physec_packet_get_size(packet));
    update_physec_state(PHYSEC_STATE_KEYGEN);
  }

  return true;
}

static void do_post_processing(void) {
  // display indexes
  uint8_t buf[256] = {0};
  tm_plog(TS_ON, VLEVEL_L, "Indexes:\n\r");
  for (size_t i = 0; i < num_indexes; i += 16) {
    memset(buf, 0, sizeof buf);
    for (size_t j = 0; j < 16; j++) {
      snprintf((char *)buf + j * 4, sizeof(buf) - j * 4, "%03ld ",
               indexes[i + j]);
    }
    tm_plog(TS_ON, VLEVEL_L, "%s\n\r", buf);
  }

