labri-progress/d2dpls/STM32PlatformCode/Firmware/SubGHz_Phy/App/subghz_phy_app.c
  switch (physec_conf.keygen.quant_type) {
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wimplicit-fallthrough"
  case QUANT_SB_EXCURSION_LOSSY:
    quant_params.dynamic = false;
    quant_params.nbits_per_sample = 1;
  case QUANT_MB_EXCURSION_LOSSY:
    tm_plog(TS_ON, VLEVEL_L, "nbits per sample: %d\n\r",
            quant_params.nbits_per_sample);
    if (num_indexes > 0) {
      quant_inter_csi_indexes(indexes, &num_indexes, NUM_MAX_QUANT_INDEX,
                              remote_indexes, num_remote_indexes);
      tm_plog(TS_ON, VLEVEL_L, "num kept excursions = %d\n\r", num_indexes);
      num_remote_indexes = 0;
      physec_key_num_bits = quant_retain_csis(
          &quant_params, physec_key, physec_key_num_bits, indexes, num_indexes);
      // num_indexes = 0;
    }
#pragma GCC diagnostic pop

    break;
  case QUANT_SB_DIFF_LOSSY:
  case QUANT_SB_LOSSY:
  case QUANT_SB_LOSSY_BLOCKWISE:
    quant_params.dynamic = false;
    quant_params.nbits_per_sample = 1;
    physec_key_num_bits = quant_dropp_csis(
        &quant_params, physec_key, physec_key_num_bits, indexes, num_indexes);
    // num_indexes = 0;
    break;
  case QUANT_ADAPTIVE:
    break;
  default:
    break;
  }
}

/*!
 *	\brief Handle Probe packet reception.
 *
 *	For Master:
 *	- check probe counter
 *	For Slave:
 *	- check probe counter (eventually rollback to previous count
 *	if one get missed, and discard saved CSIs)
 *	For Both:
 *	- handle CSI measures according to CSI type
 *
 *	\param[in] probe_resp		Received probe packet
 *	\param[in] is_master		PHYsec Role
 *
 *	\return 1 if probe is valid, 0 otherwise
 */
int handle_probe(physec_probe_packet_t *probe_resp, bool is_master) {
  uint32_t probe_resp_cnt = probe_resp->cnt;

  if (is_master) {
    if (probe_resp_cnt != probe_cnt) {
      tm_plog(TS_ON, VLEVEL_L, "Unrecoverable probe error");
      return 0;
    }
  } else {
    if (probe_resp_cnt == probe_cnt - 1) {
      probe_cnt--;
      num_csi -= last_added_num_reg_rssis;
    } else if (probe_resp_cnt != probe_cnt) {
      tm_plog(TS_ON, VLEVEL_L, "Unrecoverable probe error");
      return 0;
    }
  }

  size_t kept_rssi = 0;
  switch (physec_conf.keygen.csi_type) {
  case CSI_ADJACENT_REGISTER_RSSI:
    kept_rssi =
        (num_reg_rssis > NUM_KEPT_AR_RSSI) ? NUM_KEPT_AR_RSSI : num_reg_rssis;
    if (physec_conf.keygen.is_master) {
      memcpy(csi_measures + num_csi, reg_rssis + num_reg_rssis - kept_rssi,
             kept_rssi * sizeof(csi_t));
    } else {
      memcpy(csi_measures + num_csi, reg_rssis, kept_rssi * sizeof(csi_t));
    }
    for (size_t i = num_csi; i < num_csi + kept_rssi; i++) {
      csi_measures[i] = normalize_csi(csi_measures[i]);
    }
    num_csi += kept_rssi;
    last_added_num_reg_rssis = kept_rssi;
    break;
  case CSI_REGISTER_RSSI:
    kept_rssi = (num_reg_rssis > NUM_MAX_CSI) ? NUM_MAX_CSI - num_reg_rssis
                                              : num_reg_rssis;
    memcpy(csi_measures + num_csi, reg_rssis, num_reg_rssis * sizeof(csi_t));
    for (size_t i = num_csi; i < num_csi + kept_rssi; i++) {
      csi_measures[i] = normalize_csi(csi_measures[i]);
    }
    num_csi += kept_rssi;
    last_added_num_reg_rssis = kept_rssi;
    break;
  case CSI_PACKET_RSSI:
    csi_measures[num_csi++] = (-1) * normalize_csi(RssiValue);
    tm_plog(TS_ON, VLEVEL_L, "> RssiValue raw: %d\n",
            ((-1) * normalize_csi(RssiValue)));
    last_added_num_reg_rssis = 1;
    break;
  case CSI_CLSSI:
  default:
    break;
  }
  return 1;
}
void send_probe(uint32_t counter) {
  physec_packet_t *packet = build_probe_packet(
      physec_conf.keygen.keygen_id, counter, physec_conf.keygen.probe_padding,
      BufferTx, MAX_APP_BUFFER_SIZE);

  if (physec_conf.keygen.is_master)
    HAL_Delay(physec_conf.keygen.probe_delay);

  Radio.Send((uint8_t *)packet, physec_packet_get_size(packet));
  memset(BufferTx, 0, MAX_APP_BUFFER_SIZE);
}

physec_packet_validity_e physec_validate_packet(uint8_t *packet, size_t size) {
  if (size < sizeof(physec_packet_t)) {
    return PHYSEC_UNKNOWN_PACKET;
  }

  size -= sizeof(physec_packet_t);

  physec_packet_t *pkt = (physec_packet_t *)packet;

  // checking it is related to our current keygen
  if (pkt->keygen_id != physec_conf.keygen.keygen_id) {
    return PHYSEC_UNRELATED_PACKET;
  }
  switch (pkt->type) {
  case PHYSEC_PACKET_TYPE_PROBE:
    if (size < sizeof(physec_probe_packet_t)) {
      return PHYSEC_INVALID_PACKET;
    }
    // we have no need of checking padding bytes
    // other than for being sure packet was not corrupted
    // but its not the actual purpose
    // physec_probe_packet_t *probe_pkt = (physec_probe_packet_t
    // *)&(pkt->data); uint8_t padding_size = size -
    // sizeof(physec_probe_packet_t); if (padding_size > 0) {
    //  if (!physec_check_padding_bytes(probe_pkt->padding, padding_size))
    //    return false;
    //}
    break;
  case PHYSEC_PACKET_TYPE_KEYGEN:
    if (size < sizeof(physec_keygen_packet_t)) {
      return PHYSEC_INVALID_PACKET;
    }

    physec_keygen_packet_t *kg_pkt = (physec_keygen_packet_t *)&(pkt->data);
    switch (kg_pkt->kg_type) {
    case PHYSEC_KEYGEN_TYPE_DATA:
      if (size < PHYSEC_PACKET_KEYGEN_DATA_HEADER_SIZE) {
        return PHYSEC_INVALID_PACKET;
      }
      size -= PHYSEC_PACKET_KEYGEN_DATA_HEADER_SIZE;
      physec_keygen_data_t *kg_data = (physec_keygen_data_t *)&(kg_pkt->data);
      if (kg_data->dropped_chunk_id >= MAX_LOSSY_CHUNKS)
        return PHYSEC_INVALID_PACKET;

      break;
    case PHYSEC_KEYGEN_TYPE_RETRANSMISSION_REQ:
      if (size < sizeof(physec_keygen_retransmission_req_t)) {
        return PHYSEC_INVALID_PACKET;
      }
      break;
    case PHYSEC_KEYGEN_TYPE_ERROR:
      break;
    }

    break;
  case PHYSEC_PACKET_TYPE_RECONCILIATION:
    /* in this case, the exact size of a packet changes with the reconciliation
     * method. for that matter, we compute an "expected_size" variable based on
     * the recon method
     */
    {
      physec_recon_packet_t *recon_pkt = (physec_recon_packet_t *)&(pkt->data);
      size_t expected_size =
          sizeof(physec_packet_t) + sizeof(uint32_t) + sizeof(recon_type_t);
      switch (recon_pkt->recon_type) {
      case RECON_FE_STL:
        expected_size +=
            sizeof(uint8_t) * (PHYSEC_PACKET_RECON_DEFAULT_KEY_SIZE +
                               PHYSEC_PACKET_RECON_FE_STL_VEC_SIZE);
        break;
      case RECON_ECC_SS:
      case RECON_PCS:
      case RECON_NUM_TYPE:
        expected_size += sizeof(uint8_t) * (AES_KEY_SIZE_IN_BYTES);
        break;
      }
      if (size < expected_size) {
        tm_plog(TS_ON, VLVEL_M, "unexpected recon packet size!");
        return PHYSEC_INVALID_PACKET;
      }
      if (size < recon_pkt->rec_vec_size) {
        return PHYSEC_INVALID_PACKET;
      }

      break;
    }
  case PHYSEC_PACKET_TYPE_ENCRYPTED:
    if (size < sizeof(physec_encrypted_packet_t)) {
      return PHYSEC_INVALID_PACKET;
    }

    physec_encrypted_packet_t *enc_pkt =
        (physec_encrypted_packet_t *)&(pkt->data);
    if (size < enc_pkt->size) {
      return PHYSEC_INVALID_PACKET;
    }

    break;
  case PHYSEC_PACKET_TYPE_RECONCILIATION_RESULT:
    if (size < sizeof(physec_recon_result_packet_t)) {
      return PHYSEC_INVALID_PACKET;
    }
    return PHYSEC_VALID_PACKET;
    break;
  case PHYSEC_PACKET_TYPE_RESET:
    return PHYSEC_VALID_PACKET;
  default:
    return PHYSEC_INVALID_PACKET;
  }

  return PHYSEC_VALID_PACKET;
}

