labri-progress/d2dpls/STM32PlatformCode/Firmware/SubGHz_Phy/App/subghz_phy_app.c
/*
 * @brief This function handles the master part of reconciliation.
 * Right now it handles two recon type, none and FE STL
 * Should return false only if an implemented method fails (eg. no more retries)
 * else it should simply fallback
 */
bool try_or_retry_recon(void) {
  switch (physec_conf.keygen.recon_type) {
  case RECON_FE_STL:
    if (recon_num_try < FE_STL_MAX_LOCKS) {
      fe_stl_create_and_send_locks();
      return true;
    } else {
      return false;
    }
    /* default case is the no recon fallback */
  }
  uint8_t tmp_key[AES_KEY_SIZE_IN_BYTES] = {
      58, 64, 18, 21, 225, 219, 114, 212, 168, 239, 56, 73, 168, 217, 63, 67};
  memcpy(recon_key, tmp_key, sizeof(tmp_key));
  physec_packet_t *recon_pkt = build_recon_packet_default(
      physec_conf.keygen.keygen_id, recon_key, AES_KEY_SIZE_IN_BYTES, BufferTx,
      MAX_APP_BUFFER_SIZE);
  Radio.Send((uint8_t *)recon_pkt, physec_packet_get_size(recon_pkt));
  return true;
}

/************	Main program Loop ************/
void PHYsec_Platform_Process(void) {
  Radio.Sleep();

  // let's keep this switch simple.
  // once it will work, we will try to integrate it better
  if (reset_state > 0) {
    physec_reset_packet_t *rst_pck;
    switch (State) {
    case RX:
      tm_plog(TS_ON, VLEVEL_M, "RX");
      if (physec_validate_packet(BufferRx, RxBufferSize) ==
          PHYSEC_VALID_PACKET) {
        physec_packet_t *packet = (physec_packet_t *)BufferRx;
        switch (packet->type) {
        case PHYSEC_PACKET_TYPE_RESET:
          rst_pck = (physec_reset_packet_t *)&packet->data;
          if (rst_pck->ack) {
            tm_plog(TS_ON, VLEVEL_M, "Received RESET ACK");
            reset_handler(RECV_RST_ACK);
          } else {
            tm_plog(TS_ON, VLEVEL_M, "Received RESET");
            reset_handler(RECV_RST);
          }
          break;
        case PHYSEC_PACKET_TYPE_PROBE:
          // TODO: vérifier count à 1
          tm_plog(TS_ON, VLEVEL_M, "Received PROBE");
          reset_handler(RECV_FIRST_PROBE);
          goto keep_going;
          break;
        default:
          tm_plog(TS_OFF, VLEVEL_M, "RECEIVED %d PKT MGK\r\n", packet->type);
          break;
        }
      }
      break;
    case TX:
      break;
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wimplicit-fallthrough"
    case RX_ERROR:
      tm_plog(TS_ON, VLEVEL_M, "ERR\r\n");
    case RX_TIMEOUT:
    case TX_TIMEOUT:
      reset_handler(TIMEOUT);
      break;
    }
#pragma GCC diagnostic pop
    Radio.Rx(RX_TIMEOUT_VALUE + random_delay);
    return;
  }

  physec_packet_validity_e packet_validity;
keep_going:
  switch (State) {
  case RX:
    packet_validity = physec_validate_packet(BufferRx, RxBufferSize);
    if (packet_validity == PHYSEC_VALID_PACKET) {
      tm_plog(TS_ON, VLEVEL_H, "=== PHYsec packet received ===\n\r");
      physec_packet_t *rx_packet = (physec_packet_t *)BufferRx;

      switch (rx_packet->type) {
      case PHYSEC_PACKET_TYPE_PROBE: {
        physec_probe_packet_t *probe_resp =
            (physec_probe_packet_t *)&(rx_packet->data);

        tm_plog(TS_ON, VLEVEL_M,
                "< Probe Received ! (Packet cnt=%u, Internal cnt=%u)\n\r",
                probe_resp->cnt, probe_cnt);

        if (!handle_probe(probe_resp, physec_conf.keygen.is_master)) {
          tm_plog(TS_ON, VLEVEL_M, "Failed to handle probe");
          goto go_to_rx;
        }

        if (quant_status == QUANT_STATUS_FAILURE)
          quant_status = QUANT_STATUS_WAITING;
        update_physec_state(PHYSEC_STATE_PROBING);
        // Instead of using the type of the quant to do the verification we need
        // to add a more general verifcation like if multi_bits_quant
        if (physec_conf.keygen.is_master) {
          probe_cnt++;
          csi_t *rssi_measures = csi_measures;
          if (num_csi_more > 0) {
            num_csi_more--;
          } else if ((physec_conf.keygen.quant_type == QUANT_MBR_LOSSLESS) &&
                     measurements_sufficiency_check_mbr_lossless(rssi_measures,
                                                                 num_csi)) {
            if (do_keygen()) {
              tm_plog(TS_ON, VLEVEL_M, "> Keygen Done ! (%d bits)\n\r",
                      physec_key_num_bits);
              tm_plog(TS_ON, VLEVEL_H, "[*] Alice's Key = [\n\r");
              for (size_t i = 0; i < AES_KEY_SIZE_IN_BYTES; i++) {
                if (i == AES_KEY_SIZE_IN_BYTES - 1) {
                  tm_plog(TS_OFF, VLEVEL_L, "%02x ]\n\r", physec_key[i]);
                } else {
                  tm_plog(TS_OFF, VLEVEL_L, "%02x,\n\r", physec_key[i]);
                }
              }

              goto go_to_rx;
            } else {
              if (num_csi >= NUM_MAX_CSI) {
                reset_handler(KG_RST_REQ);
              }
            }
          } else if ((physec_conf.keygen.quant_type == QUANT_SB_LOSSLESS) &&
                     (num_csi >= 128)) {
            if (do_keygen()) {
              tm_plog(TS_ON, VLEVEL_M, "> Keygen Done ! (%d bits)\n\r",
                      physec_key_num_bits);
              tm_plog(TS_ON, VLEVEL_H, "[*] Alice's Key = [\n\r");
              for (size_t i = 0; i < AES_KEY_SIZE_IN_BYTES; i++) {
                if (i == AES_KEY_SIZE_IN_BYTES - 1) {
                  tm_plog(TS_OFF, VLEVEL_L, "%02x ]\n\r", physec_key[i]);
                } else {
                  tm_plog(TS_OFF, VLEVEL_L, "%02x,\n\r", physec_key[i]);
                }
              }

              goto go_to_rx;
            } else {
              if (num_csi >= NUM_MAX_CSI) {
                reset_handler(KG_RST_REQ);
              }
            }
          } else {
            // if the number of the measurements is not sufficient we do
            // nothing!
            tm_plog(TS_ON, VLEVEL_H, ">> Need to do more probing! \n\r");
          }
        }

        send_probe(probe_cnt);
        tm_plog(TS_ON, VLEVEL_M, "> Probe Sent ! (cnt=%u)\n\r", probe_cnt);

