labri-progress/d2dpls/STM32PlatformCode/Firmware/SubGHz_Phy/App/subghz_phy_app.c
        if (!physec_conf.keygen.is_master) {
          probe_cnt++;
        }

        break;
      }
      case PHYSEC_PACKET_TYPE_KEYGEN: {
        if (physec_state >= PHYSEC_STATE_RECONCILIATION) {
          // ignore keygen packet if we are in reconciliation state
          goto go_to_rx;
        }

        physec_keygen_packet_t *kg_pkt =
            (physec_keygen_packet_t *)&(rx_packet->data);
        tm_plog(TS_ON, VLEVEL_M, "> Keygen packet received\n\r");

        switch (handle_keygen(kg_pkt, physec_conf.keygen.is_master)) {
        case KG_QUANT_ERROR: {
          tm_plog(TS_ON, VLEVEL_M, "Quantization error\n\r");
          // An error happens during slave quantization
          if (physec_conf.keygen.is_master) {
            // go back to probing
            update_physec_state(PHYSEC_STATE_PROBING);
            num_quant_try++;
            num_csi_more = NUM_CSI_MORE_DEFAULT * num_quant_try;
            send_probe(probe_cnt);
          } else {
            // notify master to go back to probing
            physec_packet_t *packet = build_keygen_error_packet(
                physec_conf.keygen.keygen_id, BufferTx, MAX_APP_BUFFER_SIZE);
            update_physec_state(PHYSEC_STATE_PROBING);
            Radio.Send((uint8_t *)packet, physec_packet_get_size(packet));
          }
          // if (!QUANT_IS_BLOCKWISE(physec_conf.keygen.quant_type)) {
          //   physec_key_num_bits = -1;
          //   num_indexes = 0;
          // }
          goto go_to_rx;
        }
        case KG_DONE: {
          // send keygen done packet
          if (physec_conf.keygen.is_master) {
            physec_packet_t *packet = build_keygen_success_packet_lossy(
                physec_conf.keygen.keygen_id, BufferTx, MAX_APP_BUFFER_SIZE);

            Radio.Send((uint8_t *)packet, physec_packet_get_size(packet));
            update_physec_state(PHYSEC_STATE_PRE_RECONCILIATION);
            num_quant_try = 0;
          }
          break;
        }
        case KG_PP_SEND_LOST: {
          tm_plog(TS_ON, VLEVEL_M, "Send quant indexes (lost ones)\n\r");
          physec_keygen_packet_t *kg_pkt =
              (physec_keygen_packet_t *)&(rx_packet->data);
          physec_keygen_retransmission_req_t *retransmission_req =
              (physec_keygen_retransmission_req_t *)&(kg_pkt->data);
          post_process_send_indexes(retransmission_req->lost_chunks_bitmap);
          goto go_to_rx;
        }
        case KG_PP_SEND_ALL: {
          if (!physec_conf.keygen.is_master) {
            tm_plog(TS_ON, VLEVEL_M, "num key bits = %d, num indexes = %d\n\r",
                    physec_key_num_bits, num_indexes);
            do_post_processing();
            tm_plog(TS_ON, VLEVEL_M, "num key bits = %d, num indexes = %d\n\r",
                    physec_key_num_bits, num_indexes);
          }
          tm_plog(TS_ON, VLEVEL_M, "Send quant indexes (all)\n\r");
          update_physec_state(PHYSEC_STATE_POST_KEYGEN_SEND);
          post_process_send_indexes(ALL_ONES_MASK);
          time_last_pp_send_all = HAL_GetTick();
          goto go_to_rx;
        }
        case KG_PP_WAIT_MORE:
          tm_plog(TS_ON, VLEVEL_M, "Wait for more quant indexes\n\r");
          update_physec_state(PHYSEC_STATE_POST_KEYGEN_WAIT);
          goto go_to_rx;
          break;
          // post processing have been handled, wait for more
          // data packet
        case KG_SLAVE_DONE:
          // bob finished quantizing, we can start reconciliation
          update_physec_state(PHYSEC_STATE_RECONCILIATION);
          try_or_retry_recon();
          goto go_to_rx;
        default:
          goto go_to_rx;
        }

        if (physec_conf.keygen.is_master) {
          do_post_processing();
          if (QUANT_IS_LOSSY(physec_conf.keygen.quant_type)) {
            if (physec_key_num_bits < REQUIRED_NUM_BITS_PER_KEY) {
              tm_plog(TS_ON, VLEVEL_L,
                      "Not enough bits after Post Processing (%d bits). "
                      "Resetting...\n\r",
                      physec_key_num_bits);
              reset_handler(KG_RST_REQ);
              goto go_to_rx;
            }
          }
        }
        tm_send_key_info(KEY_TYPE_POST_PROCESSING, physec_key,
                         physec_key_num_bits);

        if (!physec_conf.keygen.is_master) {
          // here we are going to enter in reconciliation.
          // compute reconciliation vector according to reconciliation type
          physec_packet_t *packet_kg_done = build_keygen_slave_done(
              physec_conf.keygen.keygen_id, BufferTx, MAX_APP_BUFFER_SIZE);
          update_physec_state(PHYSEC_STATE_PRE_RECONCILIATION);
          Radio.Send((uint8_t *)packet_kg_done,
                     physec_packet_get_size(packet_kg_done));
          goto go_to_rx;
          // physec_packet_t *packet = NULL;
          // switch (physec_conf.keygen.recon_type) {
          // case RECON_FE:
          // case RECON_PCS:
          // case RECON_ECC_SS:
          // default:
          //   packet =
          //       build_recon_packet_default(physec_conf.keygen.keygen_id,
          //       physec_key, AES_KEY_SIZE_IN_BYTES,
          //                                  BufferTx, MAX_APP_BUFFER_SIZE);
          //   break;
          // }
          //
          // if (!packet) {
          //   tm_plog(TS_ON, VLEVEL_M, "Error building RECON packet\n\r");
          //   goto go_to_rx;
          // }
          //
          // tm_send_key_info(KEY_TYPE_RECONCILIATION, physec_key,
          //                  REQUIRED_NUM_BITS_PER_KEY);
          // // TODO: privacy amplification
          // // tm_send_key_info(KEY_TYPE_PRIVACY_AMPLIFICATION, physec_key,
          // // REQUIRED_NUM_BITS_PER_KEY);
          //
          // physec_state = PHYSEC_STATE_KEY_READY;
          // tm_plog(TS_ON, VLEVEL_L, "Key Ready !");
          //
          // Radio.Send((uint8_t *)packet, physec_packet_get_size(packet));
        }

        break;
      }
      case PHYSEC_PACKET_TYPE_RECONCILIATION: {
        // if (!physec_conf.keygen.is_master) {
        //   // slave send reconciliation packet, and
        //   // master performs reconciliation
        //   goto go_to_rx;
        // }
        if (!physec_conf.keygen.is_master &&
            physec_state == PHYSEC_STATE_PRE_RECONCILIATION) {
          update_physec_state(PHYSEC_STATE_RECONCILIATION);
        }

        tm_plog(TS_ON, VLEVEL_M, "> Reconciliation packet received:\n\r");
        physec_recon_packet_t *recon_pkt =
            (physec_recon_packet_t *)&(rx_packet->data);

        bool success = false;
        switch (physec_conf.keygen.recon_type) {
        case RECON_FE_STL:
          // bob is going to try reconciliating
          // {
          //   uint8_t tmp_key[AES_KEY_SIZE_IN_BYTES] = {
          //       122, 96,  82, 21, 161, 219, 242, 212,
          //       160, 239, 56, 73, 168, 209, 63,  65};
          //   memcpy(physec_key, tmp_key, sizeof(tmp_key));
          // }
          success = fe_stl_reproduce_received_locks(recon_pkt);
          break;
        case RECON_PCS:
        case RECON_ECC_SS:
        default:
          // default case without reconciliation for now
          success = true;
          memcpy(recon_key, recon_pkt->data.key, AES_KEY_SIZE_IN_BYTES);
          break;
        }
        // TODO: Add privacy amplification using ST primitives
        // tm_send_key_info(KEY_TYPE_PRIVACY_AMPLIFICATION, physec_key,
        // REQUIRED_NUM_BITS_PER_KEY);

        if (success) {
          update_physec_state(PHYSEC_STATE_KEY_READY);
          memcpy(physec_key, recon_key, AES_KEY_SIZE_IN_BYTES);
          tm_plog(TS_ON, VLEVEL_L, "Keys successfully reconciliated !\n\r");
          tm_send_key_info(KEY_TYPE_RECONCILIATION, physec_key,
                           REQUIRED_NUM_BITS_PER_KEY);
        } else {
          tm_plog(TS_ON, VLEVEL_L, " Recon Try Failed !\r\n");
        }
        physec_packet_t *pkt =
          build_recon_result_packet(physec_conf.keygen.keygen_id, BufferTx,
              MAX_APP_BUFFER_SIZE, success);
        tm_plog(TS_ON, VLEVEL_M, " Sending recon result (%s)\r\n", success ? "success" : "failure");
        Radio.Send((uint8_t *)pkt, physec_packet_get_size(pkt));
        break;
      }
      case PHYSEC_PACKET_TYPE_RECONCILIATION_RESULT: {
        physec_recon_result_packet_t *result =
            (physec_recon_result_packet_t *)&(rx_packet->data);
        if (result->success) {
          update_physec_state(PHYSEC_STATE_KEY_READY);
          memcpy(physec_key, recon_key, AES_KEY_SIZE_IN_BYTES);
          tm_send_key_info(KEY_TYPE_RECONCILIATION, physec_key,
                           REQUIRED_NUM_BITS_PER_KEY);

        } else {
          if (!try_or_retry_recon()) {
            reset_handler(KG_RST_REQ);
          }
        }
        goto go_to_rx;
        break;
      }
      case PHYSEC_PACKET_TYPE_ENCRYPTED: {
        tm_plog(TS_ON, VLEVEL_M, "> Encrypted packet received:\n\r");
        if (physec_state == PHYSEC_STATE_KEY_READY) {
          physec_encrypted_packet_t *enc_pkt =
              (physec_encrypted_packet_t *)&(rx_packet->data);

          uint8_t payload[sizeof(SECRET_MSG) + 1];
          if (enc_pkt->size != sizeof(SECRET_MSG)) {
            tm_plog(TS_ON, VLEVEL_M, "Invalid packet size !\n\r");
            goto go_to_rx;
          }
          memcpy(payload, enc_pkt->payload, enc_pkt->size);
          vigenere_encrypt_decrypt(payload, enc_pkt->size, physec_key,
                                   AES_KEY_SIZE_IN_BYTES);
          tm_plog(TS_ON, VLEVEL_L, "Decrypted message: %s\n\r", payload);
          if (memcmp(payload, SECRET_MSG, sizeof(SECRET_MSG)) == 0) {
            tm_plog(TS_ON, VLEVEL_L,
                    "Secret message successfully decrypted !\n\r");
            // Radio.Send(BufferRx, RxBufferSize);

          } else {
            tm_plog(TS_ON, VLEVEL_L, "Decryption failed !\n\r");
          }
          if (physec_conf.keygen.is_master) {
            reset_handler(USER_BTN);
          } else {
            uint8_t msg[sizeof(SECRET_MSG) + 1] = {0};
            memcpy(msg, SECRET_MSG, sizeof(SECRET_MSG));
            vigenere_encrypt_decrypt(msg, sizeof(SECRET_MSG), physec_key,
                                     AES_KEY_SIZE_IN_BYTES);
            physec_packet_t *packet = build_encrypted_packet(
                physec_conf.keygen.keygen_id, msg, sizeof(SECRET_MSG), BufferTx,
                MAX_APP_BUFFER_SIZE);
            Radio.Send((uint8_t *)packet, physec_packet_get_size(packet));
          }
        }
        break;
      }
      case PHYSEC_PACKET_TYPE_RESET: {
        tm_plog(TS_ON, VLEVEL_M, "< Reset Packet Received:\n\r");
        physec_reset_packet_t *rst_pck =
            (physec_reset_packet_t *)&rx_packet->data;

        if (!rst_pck->ack)
          reset_handler(RECV_RST);
        else
          random_delay = (Radio.Random()) >> 22;
        break;
      }
      default:
        break;
      }
    } else if (packet_validity == PHYSEC_UNRELATED_PACKET) {
      tm_plog(TS_ON, VLEVEL_H, "< Unrelated PHYsec packet received.\n\r");
      // reentry
      State = UNRELATED_RX;
      // random small delay
      uint32_t random_byte = Radio.Random() & 0xFF;
      float random_multiplier = (float)random_byte / 0xFF;
      uint32_t random_delay =
          (uint32_t)(random_multiplier * (float)physec_conf.keygen.probe_delay);

      tm_plog(TS_ON, VLEVEL_H, "Waiting for %dms\n\r", random_delay);
      HAL_Delay(random_delay);
      UTIL_SEQ_SetTask((1 << CFG_SEQ_Task_SubGHz_Phy_App_Process),
                       CFG_SEQ_Prio_0);
      return;
    } else {
      char msg[MAX_APP_BUFFER_SIZE * 2 + 1] = {0};
      hexlify(BufferRx, RxBufferSize, msg, sizeof(msg));
      tm_plog(TS_ON, VLEVEL_M, "< Invalid PHYsec packet received.\n\r");
      tm_plog(TS_ON, VLEVEL_H, "RAW = %s\n\r", msg);
      tm_plog(TS_ON, VLEVEL_H, "Discarding...\n\r");
    }
  go_to_rx:
    Radio.Rx(RX_TIMEOUT_VALUE + random_delay);
    break;
  case TX:
    Radio.Rx(RX_TIMEOUT_VALUE + random_delay);
    break;
  case RX_TIMEOUT:
  case RX_ERROR:
    tm_plog(TS_ON, VLEVEL_M, "[Timeout/Error]\r\n");
    goto handler;
  case UNRELATED_RX:
    tm_plog(TS_ON, VLEVEL_M, "[Unrelated Packet]\r\n");
    goto handler;
  case TX_FIRST_PROBE:
    tm_plog(TS_ON, VLEVEL_M, "[First Probe]\r\n");
  handler:
    // Handle retransmission in case of Error/Timeout

    switch (physec_state) {
    case PHYSEC_STATE_PRE_RECONCILIATION: {
      if (!physec_conf.keygen.is_master) {
        physec_packet_t *retrans = build_keygen_slave_done(
            physec_conf.keygen.keygen_id, BufferTx, MAX_APP_BUFFER_SIZE);
        Radio.Send((uint8_t *)retrans, physec_packet_get_size(retrans));
      }
      break;
    }
    case PHYSEC_STATE_POST_KEYGEN_SEND: {
      // if (physec_conf.keygen.is_master) {
      if (HAL_GetTick() - time_last_pp_send_all > POST_PROCESS_SEND_DELAY_MS) {
        // Send all indexes if no response (assuming slave did
        // not receive any chunks)
        tm_plog(TS_ON, VLEVEL_M, "> Post-Processing (lossy quantization)\n\r");
        // Add lossy points to KEYGEN vector
        num_indexes = (num_indexes > NUM_MAX_QUANT_INDEX) ? NUM_MAX_QUANT_INDEX
                                                          : num_indexes;
        post_process_send_indexes(ALL_ONES_MASK); // send all indexes chunks
        time_last_pp_send_all = HAL_GetTick();
      }
      break;
    }
    case PHYSEC_STATE_POST_KEYGEN_WAIT: {
      // ask for retransmission of lost chunks
      tm_plog(TS_ON, VLEVEL_M, "Requesting 0x%x indexes\n\r",
              (uint16_t)~post_process_rx_chunks);
      physec_packet_t *packet = build_keygen_retransmission_req_packet(
          physec_conf.keygen.keygen_id, ~post_process_rx_chunks, BufferTx,
          MAX_APP_BUFFER_SIZE);

      Radio.Send((uint8_t *)packet, physec_packet_get_size(packet));
      HAL_Delay(Radio.GetWakeupTime() + RX_TIME_MARGIN);
      return;
    }
    case PHYSEC_STATE_PROBING: {
      if (physec_conf.keygen.is_master == true) {
        /* Send the next PING frame */
        /* Add delay between RX and TX*/
        /* add random_delay to force sync between boards after some trials*/
        // tm_plog(TS_ON, VLEVEL_L, "Master Tx start\n\r");
        /* master sends PING*/

